{
  plugins.startup = {
    enable = true;

    settings = {
      theme = "dashboard";

      header = {
        type = "text";
        align = "center";
        content = [
          " ██╗  ██╗ █████╗ ███╗   ██╗██████╗ ███████╗██████╗ "
          " ╚██╗██╔╝██╔══██╗████╗  ██║██╔══██╗██╔════╝██╔══██╗"
          "  ╚███╔╝ ███████║██╔██╗ ██║██║  ██║█████╗  ██████╔╝"
          "  ██╔██╗ ██╔══██║██║╚██╗██║██║  ██║██╔══╝  ██╔══██╗"
          " ██╔╝ ██╗██║  ██║██║ ╚████║██████╔╝███████╗██║  ██║"
          " ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═════╝ ╚══════╝╚═╝  ╚═╝"
        ];
      };

      body = {
        type = "mapping";
        align = "center";
        content = [
          [ " Find File" "Telescope find_files" "<leader>ff" ]
          [ "󰍉 Find Word" "Telescope live_grep" "<leader>fg" ]
          [ " Recent Files" "Telescope oldfiles" "<leader>fo" ]
          [ " File Browser" "Neotree toggle" "<leader>e" ]
        ];
      };

      footer = {
        type = "text";
        align = "center";
        content = [ "nixvim" ];
      };
    };
  };
}
